In [2]:
import pandas as pd
import matplotlib.pyplot as plt

#Loading data
df = pd.read_csv("hf://datasets/lukebarousse/data_jobs/data_jobs.csv")

#Data Cleanup
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

c:\Users\sneha\anaconda3\envs\python_course\Lib\site-packages\tqdm\auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html
  from .autonotebook import tqdm as notebook_tqdm

In [ ]:
df.loc[:,'salary_year_avg':'salary_hour_avg']

        salary_year_avg  salary_hour_avg
0                   NaN              NaN
1                   NaN              NaN
2                   NaN              NaN
3                   NaN              NaN
4                   NaN              NaN
...                 ...              ...
785736              NaN              NaN
785737              NaN              NaN
785738              NaN              NaN
785739              NaN              NaN
785740              NaN              NaN

[785741 rows x 2 columns]

In [10]:
## We are going to fill these NaN value with the medain values of both, 
# it is the standard practice to deal with the NaN values in such case

median_salary_year = df['salary_year_avg'].median()
median_salary_year

115000.0

In [9]:
median_salary_hour = df['salary_hour_avg'].median()
median_salary_hour

45.97999954223633

In [ ]:
## Creating new df to keep the original intacked so that original stays safe
df_filled = df

##Now filling the NaN values using the above two variables created
df_filled['salary_year_avg'] = df_filled['salary_year_avg'].fillna(median_salary_year)
df_filled['salary_hour_avg'] = df_filled['salary_hour_avg'].fillna(median_salary_hour)

In [ ]:
##Checking if NaN are filled with the median values of both
df_filled.loc[0:10,'salary_year_avg':'salary_hour_avg']

    salary_year_avg  salary_hour_avg
0          115000.0            45.98
1          115000.0            45.98
2          115000.0            45.98
3          115000.0            45.98
4          115000.0            45.98
5          115000.0            45.98
6          115000.0            45.98
7          115000.0            45.98
8          115000.0            45.98
9          115000.0            45.98
10         115000.0            45.98

In [ ]:
## Now, removing duplicates and here too we are going to create a another dataframe
df_unique = df_filled

df_unique = df_unique.drop_duplicates()

print('Length of Original df:   ', len(df_filled))
print('Length of unique df:   ', len(df_unique))
print('Rows Dropped:   ', len(df_filled) - len(df_unique))

Length of Original df:    785741
Length of unique df:    785640
Rows Dropped:    101

In [ ]:
##Now, removing duplicated from specific columns, to drop the repitative jobs from same company

df_unique = df_unique.drop_duplicates(subset=['job_title', 'company_name'])

print('Length of Original df:   ', len(df_filled))
print('Length of unique df:   ', len(df_unique))
print('Rows Dropped:   ', len(df_filled) - len(df_unique))

##So we dropped nearly 277699 repetative jobs from same company

Length of Original df:    785741
Length of unique df:    508042
Rows Dropped:    277699